UNFCOPY.саУНФУправлениеАссортиментом/src/InformationRegisters/саУНФ_ДополнительнаяКонтактнаяИнформация/саУНФ_ДополнительнаяКонтактнаяИнформация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>саУНФ_ДополнительнаяКонтактнаяИнформация</name>
  <resources>
    <name>ЗначенияПолей</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Значение</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>GEOКоординаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_adress</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Наименование</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UNFCOPY.саУНФУправлениеАссортиментом/src/InformationRegisters/саУНФ_ДополнительнаяКонтактнаяИнформация/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	ОМ_УА = ОбщегоНазначения.ОбщийМодуль("саУНФ_Bitrix");
	Если НЕ ОМ_УА =Неопределено Тогда
		Для Каждого ТекЗапись Из ЭтотОбъект Цикл
			АдресВСвободнойФорме = Истина;
			Если ЛЕВ(СОКРЛП(ТекЗапись.Значение),1)="{" Тогда
				
				АдресВСвободнойФорме = УправлениеКонтактнойИнформацией.АдресВведенВСвободнойФорме(ТекЗапись.Значение);
				Если НЕ АдресВСвободнойФорме И ЗначениеЗаполнено(ТекЗапись.Представление) Тогда
					ЗаписьGEOКоординаты=ОМ_УА.ЗапросКоординатПоАдресу(ТекЗапись.Представление);
					
					Если ЗначениеЗаполнено(ЗаписьGEOКоординаты) Тогда
						Если ЗначениеЗаполнено(ЗаписьGEOКоординаты) Тогда
							ТекЗапись.GEOКоординаты = ЗаписьGEOКоординаты;
						КонецЕсли;
					КонецЕсли; 
				КонецЕсли;    
			КонецЕсли; 
		КонецЦикла;	
	КонецЕсли;
Если НЕ ЗначениеЗаполнено(ТекЗапись.id_adress) Тогда

	         ТекЗапись.id_adress = Новый УникальныйИдентификатор();

КонецЕсли;	
КонецПроцедуры
